dergraaf/stm32f3_minimal/systick/main.c

#include <stdint.h>
#include <stdbool.h>

#include <stm32f30x.h>

// Function prototypes
extern void delay_us(uint32_t us);
void init_clock(void);

static volatile uint32_t time = 0;

/**
 * Systick Interrupt handler
 */
void
SysTick_Handler(void)
{
	time++;
}



int
main (void)
{
	init_clock();
	
	// Struct of PIO Port E
	GPIO_TypeDef *PE = GPIOE;
	
	// Red LED (North) is PE9
	// Red LED (South) is PE13
	// Set mode to 01 -> Output
	PE->MODER = (1 << (9*2)) | (1 << (13*2));

	// Switch LED on (is connected between IO and GND => active high)
	PE->ODR = (1 << 9) | (1 << 13);
	
	uint32_t count_led1 = 0;
	uint32_t count_led2 = 0;
	while(1)
	{
		// Toggle LED1 every 500 ms
		if ((time - count_led1) >= 500) {
			count_led1 = time;

			if (PE->ODR & (1 << 9)) {
				PE->BRR = (1 << 9);
			}
			else {
				PE->BSRR = (1 << 9);
			}
		}
		
		// Toggle LED2 every 300 ms
		if ((time - count_led2) >= 300) {
			count_led2 = time;

			if (PE->ODR & (1 << 13)) {
				PE->BRR = (1 << 13);
			}
			else {
				PE->BSRR = (1 << 13);
			}
		}
	}
}

void
init_systick(void)
{
	// Lower systick interrupt priority to lowest level
	NVIC_SetPriority(SysTick_IRQn, 0xf);
	
	// Set interrupt frequency to 1000 Hz
	SysTick->LOAD = (F_CPU / 1000) - 1;
	
	SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
	                SysTick_CTRL_ENABLE_Msk |
	                SysTick_CTRL_TICKINT_Msk;
}

/**
 * Initialize the system clock.
 * 
 * Uses the external 8 MHz clock from the ST-Link to generate the
 * 72 MHz system clock.
 */
void
init_clock(void)
{
	// use external 8MHz clock from ST-LINK
	RCC->CR |= RCC_CR_HSEBYP | RCC_CR_HSEON;
	
	// wait until the external clock is stable
	uint32_t t = 1500;
	while (!(RCC->CR & RCC_CR_HSERDY) && --t) {
	}
	
	if (!(RCC->CR & RCC_CR_HSERDY)) {
		// no external clock found => abort
		return;
	}
	
	uint32_t tmp = 0;
	// Read reserved and read-only values and clear all other values
	tmp |= RCC->CFGR & ((1 << 31) | (1 << 30) | (1 << 29) | (1 << 28) | (1 << 27) |
	                    (1 << 15) | (1 << 14) |
	                    (1 << 3) | (1 << 2));

	// PLLSRC source for PLL
	tmp |= RCC_CFGR_PLLSRC_PREDIV1;
	
	// PLLMUL = factor is user defined
	tmp |= RCC_CFGR_PLLMULL9;
	
	RCC->CFGR = tmp;
	
	// enable PLL
	RCC->CR |= RCC_CR_PLLON;	

	// Wait until the PLL is stable
	while (!(RCC->CR & RCC_CR_PLLRDY)) {
		if (!(--t)) {
			return false;
		}
	}
	
	// Switch to the PLL
	// AHB = 72 / 1 = 72 MHz
	RCC->CFGR = ( RCC->CFGR & 0xffff0000) |
	            ((RCC_CFGR_PPRE1_DIV2 | // APB1 = 72 / 2 = 36 MHz
	              RCC_CFGR_PPRE2_DIV1 | // APB2 = 72 / 1 = 72 MHz
	              RCC_CFGR_HPRE_DIV1 |  // SYSCLK = 72 / 1 = 72 MHz
	              RCC_CFGR_SW_PLL) &    // select PLL as source
	              0x0000ffff);

	// Wait till the main PLL is used as system clock source
	while ((RCC->CFGR & (uint32_t) RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);
	{
	}
}

/**
 * Stub required by newlibc.
 * 
 * E.g. for malloc()
 */
void
_sbrk(void)
{
}

/**
 * Stub required by newlibc.
 *
 * Used for static constructors in C++
 */
void
_init(void)
{
}

